{"glGetShaderInfoLog": 933, "getCount": 397, "getBackStackEntryAt": 329, "ArrayAdapter<CharSequence>": 0, "addHeaderView": 21, "getOrientation": 663, "getYear": 892, "ofInt": 1152, "getPositionForView": 695, "getUuid": 864, "onCreateOptionsMenu": 1170, "gluErrorString": 959, "createView": 176, "performAccessibilityAction": 1264, "addPreferredActivity": 35, "getLaunchIntentForPackage": 580, "setInputType": 1670, "getListAdapter": 604, "setFastScrollAlwaysVisible": 1591, "glBindAttribLocation": 897, "onReceivedError": 1209, "setCornerRadii": 1512, "setSearchableInfo": 1890, "openDevice": 1246, "writeDescriptor": 2129, "setHttpAuthUsernamePassword": 1642, "setCursor": 1524, "getMediaScannerUri": 632, "inKeyguardRestrictedInputMode": 993, "isUserAMonkey": 1080, "setTag": 1936, "onPageFinished": 1200, "getInstallerPackageName": 543, "getPackedPositionGroup": 676, "getFillAfter": 488, "setLevel": 1700, "copyBackForwardList": 149, "registerInputDeviceListener": 1309, "nextSpanTransition": 1142, "ofFloat": 1151, "setMaxScrollX": 1725, "onSurfaceCreated": 1232, "isProviderEnabled": 1066, "getVisitedHistory": 879, "setMediaPlayer": 1732, "getOrigins": 665, "allowScanningByMediaScanner": 53, "getSoftInputMode": 774, "onJsAlert": 1188, "setSpan": 1915, "glDrawArrays": 917, "createUri": 175, "getRotationMatrix": 739, "computeScrollOffset": 140, "getBSSID": 328, "onLocationChanged": 1197, "clearAll": 107, "getSensorList": 765, "setSpacing": 1914, "setTargetFragment": 1939, "killBackgroundProcesses": 1092, "isRecognitionAvailable": 1067, "toggle": 2100, "setCompoundDrawablePadding": 1498, "hasService": 982, "getPackageInfo": 670, "getFocusDistances": 499, "updateDate": 2115, "getMaxNumDetectedFaces": 625, "listenUsingRfcommWithServiceRecord": 1097, "onHideCustomView": 1180, "eglSwapBuffers": 231, "clearSslPreferences": 125, "setChangingConfigurations": 1481, "zoomIn": 2135, "getState": 786, "findFragmentByTag": 259, "playSilence": 1270, "setNumber": 1758, "onReceivedLoginRequest": 1212, "removeSessionCookie": 1341, "getLocalClassName": 612, "getBearing": 333, "setDownloadListener": 1561, "getURL": 853, "newApplication": 1131, "removeActiveAdmin": 1317, "callActivityOnNewIntent": 80, "performItemClick": 1266, "setDefaultFixedFontSize": 1533, "enable": 234, "allocateAppWidgetId": 52, "setScreenBright": 1884, "getRunningAppProcesses": 743, "setContentView": 1509, "onConsoleMessage": 1167, "getGpsStatus": 512, "removeAllActivities": 1318, "getTabHost": 818, "shouldRewriteQueryFromData": 2023, "addLocalService": 27, "startForeground": 2055, "addOnAccountsUpdatedListener": 31, "setFilterQueryProvider": 1601, "onUpdate": 1239, "setOutsideTouchable": 1806, "handleKeyDown": 969, "loadAnimator": 1099, "queryIntentActivities": 1287, "enableShutterSound": 239, "getScanResults": 750, "getPreviewFrameRate": 705, "setFilterBitmap": 1599, "setAnimationListener": 1439, "getCertificate": 353, "isDigitsOnly": 1030, "setIndicator": 1664, "setTransition": 1974, "getWhiteBalance": 883, "setOnEventListener": 1774, "dispatchDestroy": 208, "setScrollable": 1888, "zoomOut": 2136, "unregisterListener": 2108, "getColorForState": 372, "distanceTo": 216, "getNumColumns": 653, "getIndexCount": 534, "getFavicon": 484, "startSearch": 2065, "findFragmentById": 258, "setFillBefore": 1596, "isKeyguardLocked": 1052, "getLoader": 609, "setEmptyView": 1577, "setSupportMultipleWindows": 1933, "getConnectedDevices": 386, "getLocale": 613, "queryIntentServices": 1288, "registerDisplayListener": 1307, "setNegativeButton": 1751, "setPictureFormat": 1824, "getDocumentId": 457, "getZoom": 893, "sendKeySync": 1414, "glUniformMatrix4fv": 955, "filter": 252, "U8_4": 4, "setLongitude": 1717, "showAtLocation": 2027, "remove": 1315, "setPasswordMinimumLetters": 1815, "setView": 1988, "setDisplayHomeAsUpEnabled": 1546, "describeContents": 187, "setOnValueChangedListener": 1797, "excludeTarget": 247, "getFileExtensionFromUrl": 487, "setListShownNoAnimation": 1709, "getChildTabViewAt": 365, "getBoolean": 339, "glIsTexture": 937, "getAdjustViewBounds": 296, "hasAltitude": 971, "getExpandableListAdapter": 474, "setWindowLayoutMode": 2007, "getCause": 352, "getCameraDisabled": 350, "setAllCaps": 1427, "getAllProviders": 299, "glLinkProgram": 938, "stringOrSpannedString": 2082, "putLong": 1282, "readNextHeader": 1296, "setScrollingCacheEnabled": 1889, "setMeteringAreas": 1736, "end": 242, "requestDisallowInterceptTouchEvent": 1357, "getLauncherLargeIconDensity": 581, "isChecked": 1023, "obtainAttributes": 1148, "getScaleType": 748, "setWhiteBalance": 2003, "getCurrY": 402, "getKey": 573, "getSurfaceHolder": 812, "ready": 1298, "onDeleted": 1174, "setLayerInset": 1696, "isPopupShowing": 1062, "cancelThumbnailRequest": 95, "getResources": 735, "setUseWideViewPort": 1977, "setOngoing": 1801, "requiresCell": 1371, "setTimeListener": 1961, "removeTabAt": 1345, "setColorEffect": 1492, "setExtras": 1588, "setDrawSelectorOnTop": 1562, "setPreviewTexture": 1840, "isGraphic": 1040, "reset": 1372, "getPackedPositionChild": 673, "getArguments": 320, "getIndex": 533, "setIntrinsicHeight": 1677, "getDeclination": 422, "setSmoothScrollingEnabled": 1909, "setNightMode": 1754, "addFooterView": 18, "eglInitialize": 228, "addTab": 40, "setFriction": 1615, "setAltitude": 1435, "onJsPrompt": 1191, "getPasswordMinimumLength": 684, "getBitmap": 335, "getHeight": 519, "gluOrtho2D": 961, "getCallingPackage": 349, "getVendor": 871, "setEvaluator": 1583, "saveState": 1399, "updateConfiguration": 2113, "bigLargeIcon": 68, "setWifiEnabled": 2005, "canZoomIn": 85, "setPasswordMinimumSymbols": 1819, "setOnShowListener": 1791, "seekTo": 1405, "stopLoading": 2072, "getFormat": 504, "getIssuedTo": 562, "computeScroll": 139, "onResult": 1220, "show": 2025, "getHint": 520, "runOnMainSync": 1390, "stopPlayback": 2074, "pause": 1259, "getUrl": 857, "startListening": 2057, "isPreview": 1064, "setFillViewport": 1598, "getSequence": 766, "setSceneMode": 1883, "getHorizontalViewAngle": 523, "getCallback": 347, "cancelLongPress": 93, "claimInterface": 105, "getFileDescriptor": 486, "setSuggestionsAdapter": 1931, "setOnSuggestionListener": 1792, "getInputMethodMode": 536, "getCurrentView": 413, "setContentText": 1507, "setAutoFocusMoveCallback": 1452, "onPageStarted": 1201, "stopForeground": 2070, "connectGatt": 147, "setScaleType": 1882, "onReceivedHttpAuthRequest": 1210, "setZoomOutEnabled": 2015, "getGroupView": 515, "getSortKey": 775, "getFromLocation": 508, "getListPaddingRight": 606, "getSelectedItem": 757, "getUuids": 865, "setCountryName": 1516, "setSound": 1912, "eglCreatePbufferSurface": 222, "reverseTransition": 1388, "setAccountAuthenticatorResult": 1420, "setPendingIntentTemplate": 1822, "playSequentially": 1269, "setOneShot": 1799, "setWhen": 2002, "setLineSpacing": 1703, "reverse": 1387, "apply": 57, "setBeamPushUris": 1460, "draw": 219, "setWallpaperOffsets": 1996, "getStartOffset": 784, "createGroup": 164, "setOnTimeChangedListener": 1794, "setMaxEms": 1722, "glBindFramebuffer": 899, "setCanceledOnTouchOutside": 1479, "getRotationMatrixFromVector": 740, "split": 2044, "getLineStart": 600, "enableForegroundDispatch": 236, "resolveSize": 1380, "getReceiverInfo": 723, "getDisplayMetrics": 450, "getDefaultVideoPoster": 431, "showPrevious": 2032, "getString": 788, "onLowMemory": 1198, "newEditable": 1133, "pauseTimers": 1260, "onItemLongClick": 1186, "getTileModeX": 837, "getElapsedRealtimeNanos": 463, "setCurrentMinute": 1520, "buildDocumentUri": 75, "addTransitionListener": 45, "readLine": 1295, "getDatePicker": 419, "getDisplayLabel": 449, "setThumbOffset": 1956, "setHomeActionContentDescription": 1636, "isActivePasswordSufficient": 1014, "waitForIdleSync": 2123, "setMessage": 1735, "getPackageName": 671, "setIntValues": 1672, "getProgressDrawable": 715, "getNavigationItemCount": 649, "setColors": 1495, "isDetached": 1029, "getCompoundPaddingTop": 383, "hasStableIds": 984, "setSpeed": 1917, "getCurrentFocus": 405, "onKeyUp": 1193, "createMime": 167, "copySpansFrom": 152, "dispatchPause": 211, "setChoiceMode": 1487, "setPasswordQuality": 1821, "getMinimumHeight": 643, "setImageAlpha": 1648, "getBestProvider": 334, "unscheduleSelf": 2110, "getFraction": 505, "invoke": 1010, "getMaxZoom": 629, "getFooterViewsCount": 502, "getSupportedFlashModes": 800, "getInterpolator": 557, "getCompoundPaddingRight": 382, "computeHorizontalScrollRange": 138, "getPowerRequirement": 698, "guessFileName": 967, "hashCode": 990, "setTypeface": 1975, "getVideoStabilization": 876, "getAccounts": 281, "getGlobalSearchActivity": 511, "runTestOnUiThread": 1393, "getAdminArea": 297, "onProgressChanged": 1204, "setUserData": 1979, "hasBearing": 972, "setListNavigationCallbacks": 1708, "requestPeers": 1365, "setOnKeyListener": 1782, "getFrame": 507, "peekDrawable": 1262, "setBeamPushUrisCallback": 1461, "removeUpdates": 1352, "disableForegroundDispatch": 195, "onInit": 1181, "glGetShaderiv": 934, "createWindowSurface": 178, "glDeleteFramebuffers": 910, "openOptionsMenu": 1248, "notify": 1143, "getStringArray": 789, "setWrapSelectorWheel": 2008, "getSupportedWhiteBalance": 811, "getLong": 617, "deleteHost": 186, "replaceOrMake": 1355, "getNetworkId": 651, "glFinish": 921, "lockNow": 1110, "setBackgroundDrawable": 1457, "confirm": 145, "getLocalActivityManager": 611, "onKeyDown": 1192, "clearMatches": 118, "cancel": 87, "sync": 2090, "setPreviewCallback": 1833, "loadLogo": 1106, "getExtra": 480, "onWriteFailed": 1242, "discoverServices": 202, "setOnGroupExpandListener": 1777, "getUserStyle": 863, "setMinWidth": 1741, "getRating": 722, "getLineRight": 599, "setText": 1943, "getColorStateList": 374, "setGradientCenter": 1625, "setImageViewResource": 1657, "getSpans": 781, "setOnNdefPushCompleteCallback": 1784, "checkPermission": 101, "getLineMax": 598, "isRunning": 1070, "getType": 847, "isAdded": 1015, "getContentUriForPath": 393, "computeVerticalScrollExtent": 141, "getMaxExposureCompensation": 624, "onScaleChanged": 1224, "destroyActivity": 189, "stop": 2069, "setOnInfoListener": 1778, "getMimeTypeFromExtension": 640, "getCertificateChain": 354, "setInAnimation": 1660, "requestWindowFeature": 1370, "glPixelStorei": 942, "setOnTabChangedListener": 1793, "getDefaultColor": 425, "findNext": 260, "canGoBackOrForward": 82, "setAuthToken": 1448, "glUseProgram": 956, "stopSelf": 2077, "setIntent": 1673, "removeAllUpdateListeners": 1323, "setIntentRedelivery": 1674, "clearAllTabs": 108, "setContent": 1503, "clearWallpaperOffsets": 128, "setTabListener": 1935, "getCurrentItem": 407, "setNumColumns": 1757, "onCloseWindow": 1165, "setTarget": 1937, "getSupportedPreviewSizes": 808, "onWindowFocusChanged": 1241, "setAdapter": 1422, "getUriString": 856, "setSelector": 1898, "getValidNotAfter": 866, "setScrollBarStyle": 1885, "blockingGetAuthToken": 72, "setSelection": 1895, "glTexEnvx": 946, "getParcelableData": 681, "setAllowUniversalAccessFromFileURLs": 1431, "setMaxScrollY": 1726, "getComponentName": 377, "getPackageArchiveInfo": 669, "getCompoundDrawablePadding": 378, "setTitleColor": 1963, "getApplication": 315, "jumpToCurrentState": 1090, "setProgressBarIndeterminate": 1844, "setDisplayShowCustomEnabled": 1549, "scrollTo": 1404, "bindAppWidgetIdIfAllowed": 71, "setVolumeControlStream": 1994, "setRecognitionListener": 1861, "setPasswordMinimumUpperCase": 1820, "addLevel": 24, "performLongClick": 1267, "getPreviewFormat": 703, "gluUnProject": 963, "enableForegroundNdefPush": 237, "getInAnimation": 531, "scheduleSelf": 1403, "resolveAttribute": 1376, "ellipsize": 233, "setJpegQuality": 1687, "hasAccuracy": 970, "setDropDownHorizontalOffset": 1566, "startTransition": 2068, "getMinExposureCompensation": 642, "isDataUrl": 1027, "getLastNonConfigurationInstance": 577, "rotateM": 1389, "getCheckedItemPositions": 360, "orthoM": 1251, "setGpsTimestamp": 1624, "lineNumber": 1095, "getDefaultAdapter": 424, "removeFooterView": 1328, "createFromBitmap": 157, "glCreateProgram": 908, "setOnCompletionListener": 1768, "getContactLookupUri": 389, "setLayoutAlgorithm": 1698, "onCreateInputConnection": 1169, "getSupportedPreviewFormats": 805, "getTypeLabel": 848, "setOverScrollMode": 1807, "getUriForDownloadedFile": 855, "onError": 1177, "indexOf": 995, "setSupportZoom": 1934, "onSurfaceChanged": 1231, "getAvailableDrmEngines": 327, "setOnEditorActionListener": 1772, "onProviderEnabled": 1206, "setOnErrorListener": 1773, "partiallyUpdateAppWidget": 1258, "cancelAutoFocus": 90, "queryMiniThumbnail": 1289, "dispatchGenericMotionEvent": 209, "setExposureCompensation": 1587, "setScrollY": 1887, "addState": 39, "getLineWidth": 602, "reconnect": 1300, "dispatchTouchEvent": 214, "getUserName": 862, "getTitle": 840, "create": 154, "getSelectedItemPosition": 759, "disable": 194, "getPreviewFpsRange": 704, "getBluetoothClass": 336, "getLineCount": 593, "getExtensionFromMimeType": 479, "getLineBounds": 592, "setIndeterminateDrawable": 1663, "addCompletedDownload": 15, "glUniform1i": 953, "getLastVisiblePosition": 578, "setOwnerActivity": 1808, "getSingleton": 772, "createInstance": 166, "writeEntityHeader": 2131, "getServices": 769, "startActivityFromChild": 2050, "removeTransitionListener": 1350, "charAt": 98, "setLoadsImagesAutomatically": 1711, "setInput": 1668, "takePicture": 2091, "getGravity": 513, "setMimeType": 1737, "getProductId": 711, "eglCreateWindowSurface": 223, "setOnItemClickListener": 1779, "getPackedPositionForGroup": 675, "setNetworkAvailable": 1752, "setIcon": 1643, "skip": 2035, "smoothScrollToPositionFromTop": 2040, "append": 55, "addView": 47, "setSavePassword": 1881, "setGLWrapper": 1618, "setShaderFactory": 1900, "hasLongitude": 979, "setPromptView": 1852, "setAppCachePath": 1446, "getMaxAddressLineIndex": 623, "pageUp": 1257, "onRequestContinued": 1217, "moveTaskToBack": 1126, "glVertexAttribPointer": 957, "onAutoFocus": 1161, "createContext": 156, "setImageMatrix": 1652, "setListAdapter": 1707, "setSelected": 1893, "getActivities": 287, "getAnimation": 307, "setFeatureName": 1594, "getResult": 737, "setPostalCode": 1830, "setFocusable": 1610, "isShowing": 1073, "onItemCheckedStateChanged": 1184, "setDefaults": 1538, "getLayoutDirection": 585, "addAccountExplicitly": 11, "getOpacity": 662, "getEventType": 473, "setMultiChoiceModeListener": 1746, "getSupportedPictureSizes": 804, "getRequestedOrientation": 728, "getInterfaceSubclass": 554, "getValidNotBeforeDate": 869, "getInstalledApplications": 540, "getLookupUri": 619, "dismiss": 203, "getValue": 870, "add": 8, "supportsAltitude": 2087, "getFocalLength": 497, "setImageViewBitmap": 1656, "getText": 827, "setProperty": 1853, "getResolution": 729, "setLights": 1702, "setFilterById": 1600, "expandTemplate": 251, "close": 130, "destroySurface": 191, "onDismiss": 1175, "getTypeResource": 850, "getBounds": 340, "unregisterInputDeviceListener": 2107, "setExact": 1586, "findDrawableByLayerId": 257, "getDisplayOptions": 452, "isCancelled": 1021, "findAccessibilityNodeInfosByViewId": 254, "setAcceptCookie": 1419, "createWifiLock": 177, "clearHttpAuthUsernamePassword": 116, "flatten": 268, "peekAuthToken": 1261, "setSplitBackgroundDrawable": 1919, "isGroupOwner": 1042, "restrictDuration": 1384, "performGlobalAction": 1265, "clearUsernamePassword": 126, "setImageResource": 1653, "setMenuVisibility": 1734, "smoothScrollToPosition": 2039, "isOngoing": 1059, "setCustomSelectionActionModeCallback": 1527, "getMinDelay": 641, "setVisibility": 1991, "getFlashMode": 494, "getCurrentTextColor": 412, "removeTestProvider": 1347, "setGpsLatitude": 1621, "finishFromChild": 267, "addWord": 48, "overlayHorizontalScrollbar": 1252, "postUrl": 1276, "setFocusableInTouchMode": 1611, "addHelper": 22, "queueEvent": 1291, "setBearing": 1462, "setButton2": 1470, "isKeyguardSecure": 1053, "getInstrumentation": 545, "getImeOptions": 530, "runQuery": 1392, "setRadius": 1858, "requestLayout": 1363, "loadData": 1101, "setHomeAsUpIndicator": 1637, "setProgress": 1842, "getAccuracy": 284, "clearPackagePreferredActivities": 120, "addRule": 37, "getWidth": 884, "getId": 527, "getBackgroundColor": 332, "resetPassword": 1373, "getInterfaceClass": 552, "getLocales": 614, "getPrivateKey": 708, "setOnClickListener": 1765, "keyFor": 1091, "onPause": 1202, "clearSpans": 124, "setSelectionFromTop": 1897, "setDismissMessage": 1545, "getInstance": 544, "autoFocus": 64, "get": 280, "getWrappedAdapter": 888, "getCurrentIndex": 406, "hide": 991, "dispatchKeyEvent": 210, "removeAllIcons": 1320, "setPasswordMinimumNumeric": 1818, "isPrivateBrowsingEnabled": 1065, "getResourceTypeName": 734, "getBufferPercentage": 342, "shouldOverrideKeyEvent": 2021, "invokeZoomPicker": 1011, "loadContactPhoto": 1100, "getListPaddingTop": 607, "playTogether": 1271, "disableKeyguard": 197, "guessUrl": 968, "getLength": 587, "setLinksClickable": 1706, "getActivityIcon": 289, "setMaxWidth": 1728, "updateQuota": 2119, "getChars": 357, "getAppWidgetOptions": 314, "getShowsDialog": 771, "capturePicture": 96, "setBuiltInZoomControls": 1468, "getLauncherLargeIconSize": 582, "getMacAddress": 620, "getApplicationLabel": 319, "onTabChanged": 1233, "glCompressedTexImage2D": 907, "setNotifyOnChange": 1756, "setCompoundDrawablesWithIntrinsicBounds": 1502, "getTargetPackage": 823, "removeSpan": 1342, "restoreState": 1383, "getCompoundPaddingBottom": 380, "getItemAtPosition": 565, "setDisplayOptions": 1547, "isNdefPushEnabled": 1056, "getMinimumWidth": 644, "getMaxNumMeteringAreas": 627, "setNdefPushMessageCallback": 1749, "setBase": 1458, "eglTerminate": 232, "resolveService": 1379, "getWifiState": 885, "getInstalledProviders": 542, "getMetaState": 639, "setPreviewDisplay": 1835, "hasStarted": 985, "setInitialScale": 1667, "getSupportedSceneModes": 809, "startSync": 2067, "setInteractive": 1675, "showQuickContact": 2033, "setLocale": 1712, "setModal": 1742, "getCurrentPlayTime": 408, "getLineEnd": 594, "glOrthof": 941, "glIsFramebuffer": 936, "setWebViewClient": 2000, "setStartTime": 1923, "setItemsCanFocus": 1684, "getJpegThumbnailSize": 572, "glGetIntegerv": 931, "setGpsProcessingMethod": 1623, "getLineAscent": 589, "getNumberOfCameras": 654, "ofObject": 1154, "getDescriptor": 432, "setTouchEventsEnabled": 1968, "setPreviewFrameRate": 1838, "onScrollStateChanged": 1227, "getDeviceProtocol": 441, "setClassName": 1488, "onScroll": 1225, "onPrepareOptionsMenu": 1203, "getPayload": 686, "setGpsAltitude": 1620, "newTabSpec": 1139, "removeSpeed": 1343, "readPendingIntentOrNullFromParcel": 1297, "setDefaultTextEncodingName": 1536, "setJpegThumbnailSize": 1689, "getPassword": 683, "isAssetUrl": 1017, "isValid": 1081, "doUpdateVisitedHistory": 217, "getFastDrawable": 483, "popBackStack": 1273, "isGroupExpanded": 1041, "onRestoreInstanceState": 1219, "setAutoDismissed": 1450, "getCurrentActivity": 404, "getFirstVisiblePosition": 493, "unregisterForContextMenu": 2106, "getMenuInflater": 636, "setAutoLinkMask": 1453, "setBearingRequired": 1463, "getDesiredWidth": 435, "dismissAllowingStateLoss": 204, "findAccessibilityNodeInfosByText": 253, "setDisplayedChild": 1554, "setBitmap": 1465, "setDatabaseEnabled": 1530, "getIcon": 525, "requestIconForPageUrl": 1361, "createTyped": 174, "stopSync": 2080, "requestLocationUpdates": 1364, "setResult": 1876, "insert": 1001, "setAlpha": 1434, "setRegistrationListener": 1865, "onStatusChanged": 1229, "addAccessibilityStateChangeListener": 9, "println": 1279, "getCacheMode": 346, "distanceBetween": 215, "isHttpUrl": 1045, "getMaxNumFocusAreas": 626, "gluPerspective": 962, "finishAffinity": 266, "open": 1244, "getScale": 747, "getSelectionEnd": 763, "disableForegroundNdefPush": 196, "getVerticalAlignment": 874, "setFillAfter": 1595, "lookupContact": 1111, "setIs24HourView": 1680, "addParentStack": 34, "setRating": 1859, "texSubImage2D": 2093, "getDeclaredLength": 421, "runOnUiThread": 1391, "pageDown": 1255, "stripAnchor": 2083, "getGlEsVersion": 510, "setOnUtteranceProgressListener": 1796, "savePassword": 1397, "canPause": 84, "getCompoundDrawables": 379, "getAnimationStyle": 309, "getConnectionInfo": 387, "getBackStackEntryCount": 330, "generateDefaultLayoutParams": 279, "getSpanFlags": 779, "setMinHeight": 1738, "setDivider": 1557, "setWindow": 2006, "insertImage": 1002, "getSubLocality": 792, "startActivity": 2048, "setDropDownViewResource": 1567, "setImeOptions": 1659, "getRemovedCount": 727, "getInputType": 538, "setNeedInitialFocus": 1750, "hasValue": 988, "makeCustomAnimation": 1113, "resumeTimers": 1386, "getCheckedItemPosition": 359, "getDesiredMinimumHeight": 433, "setAltitudeRequired": 1436, "setTextViewText": 1951, "getOutAnimation": 666, "updateNetwork": 2118, "isResumed": 1069, "commitAllowingStateLoss": 135, "glBufferData": 902, "setEventTime": 1584, "getPrimaryError": 707, "getDirection": 448, "removeNmeaListener": 1336, "setWebView": 1999, "getRunningServices": 744, "executePendingTransactions": 248, "glGetAttribLocation": 928, "isItemChecked": 1051, "clearColorFilter": 112, "setOnSeekBarChangeListener": 1790, "getOriginalUrl": 664, "setProgressStyle": 1850, "getSupportedAntibanding": 798, "getSuggestPath": 795, "onTooManyRedirects": 1235, "getEmptyView": 465, "updateAppWidget": 2112, "getItemIdAtPosition": 567, "requestConnectionInfo": 1356, "onRequestFocus": 1218, "setCookie": 1511, "isLanguageAvailable": 1054, "addRequestHeader": 36, "setString": 1927, "setSingleChoiceItems": 1904, "setValue": 1980, "multiplyMV": 1129, "getMenu": 635, "glBindTexture": 900, "getVerticalViewAngle": 875, "setValues": 1981, "getHintId": 521, "subSequence": 2084, "areDefaultsEnforced": 60, "getTag": 820, "getData": 416, "getAngleChange": 304, "setOnlyAlertOnce": 1802, "install": 1003, "read": 1292, "setIconAttribute": 1644, "getCheckedRadioButtonId": 361, "toHtml": 2098, "send": 1410, "getIssuedBy": 561, "createInsecureRfcommSocketToServiceRecord": 165, "isNetworkUrl": 1057, "setWebChromeClient": 1997, "copyTo": 153, "setFromIndex": 1616, "addContentView": 16, "setAutoExposureLock": 1451, "isFileUrl": 1037, "loadInterpolator": 1104, "clearMetaKeyState": 119, "startIntentSenderForResult": 2056, "setSpeechRate": 1916, "calculateSignalLevel": 79, "getPendingIntent": 687, "getFontScale": 501, "setChildDivider": 1486, "startPage": 2061, "setPreserveEGLContextOnPause": 1832, "setAllowedNetworkTypes": 1432, "eglDestroyContext": 224, "getDisplayedChild": 453, "setColor": 1491, "unregisterActivityLifecycleCallbacks": 2104, "removeUpdateListener": 1351, "setLanguage": 1692, "hasPermission": 981, "getPackedPositionForChild": 674, "setLayerType": 1697, "unscheduleDrawable": 2109, "setIndeterminate": 1662, "setFactory": 1590, "glGetUniformLocation": 935, "setCacheColorHint": 1473, "onValueChange": 1240, "getDimensionPixelSize": 447, "dataChanged": 180, "getTargetFragment": 822, "messageLevel": 1125, "glDisable": 915, "setLogo": 1715, "setRenderPriority": 1869, "startNow": 2060, "requestRender": 1367, "onReachedMaxAppCacheSize": 1208, "appendRecord": 56, "requestImageRef": 1362, "saveRecentQuery": 1398, "ArrayAdapter<ColorHolder>": 1, "getSupportedPreviewFpsRange": 806, "isDiscovering": 1031, "getPicture": 690, "getLineLeft": 597, "afterTextChanged": 51, "getInputDeviceIds": 535, "setCacheMode": 1474, "sendAccessibilityEvent": 1411, "addOnBackStackChangedListener": 32, "isEmpty": 1035, "getTabCount": 817, "onRetainNonConfigurationInstance": 1222, "hasEphemeris": 975, "setWallpaperOffsetSteps": 1995, "shouldDelayChildPressedState": 2020, "setCurrentTabByTag": 1523, "setShape": 1902, "isFinished": 1038, "isStarted": 1076, "getMaxSatellites": 628, "newInstance": 1134, "getMax": 622, "setProgressDrawable": 1847, "restartPackage": 1382, "disconnect": 200, "getTabAt": 815, "getCameraInfo": 351, "selectDrawable": 1408, "notifyDataSetInvalidated": 1146, "isSpeaking": 1075, "onFormResubmission": 1178, "getPictureFormat": 691, "setAllowFileAccessFromFileURLs": 1430, "setColorMode": 1494, "setContentWidth": 1510, "getDefaultUserAgent": 430, "setRepeating": 1873, "getComponent": 375, "setCompoundDrawablesRelative": 1500, "removeAllTabs": 1322, "proceed": 1280, "disableNetwork": 198, "setKeyProgressIncrement": 1691, "setSelectedNavigationItem": 1894, "setLinkTextColor": 1705, "getIdentifier": 528, "setGroupIndicator": 1629, "enableTransitionType": 240, "isVideoStabilizationSupported": 1084, "getTotalPaddingLeft": 842, "removeTouchExplorationStateChangeListener": 1349, "setup": 2017, "getSource": 776, "newKeyguardLock": 1135, "delete": 181, "setEngineByPackageName": 1580, "setDropDownBackgroundResource": 1564, "setTitle": 1962, "openRawResource": 1249, "getSupportedColorEffects": 799, "stopSmoothZoom": 2079, "reclaimViews": 1299, "setAutoCancel": 1449, "eglPresentationTimeANDROID": 230, "computeVerticalScrollRange": 143, "setImageDrawable": 1650, "setTileModeXY": 1959, "getContext": 395, "glShaderSource": 945, "readEntityData": 1294, "getDividerHeight": 456, "setRepeatMode": 1872, "addTouchExplorationStateChangeListener": 44, "getJpegThumbnailQuality": 571, "setContentInfo": 1505, "getEGLErrorString": 462, "setTransformationType": 1973, "getNumberOfFrames": 655, "getTypeface": 851, "build": 73, "setWeightSum": 2001, "setStroke": 1928, "getInstalled": 539, "setUserAgentString": 1978, "getEllipsisCount": 464, "applyStyle": 58, "next": 1141, "setAnimateFirstView": 1438, "setResource": 1875, "isInitialized": 1050, "setDelay": 1539, "suggestDesiredDimensions": 2086, "isScanAlwaysAvailable": 1072, "isWifiEnabled": 1086, "setMovementMethod": 1744, "getDrawableForDensity": 459, "setHighlightColor": 1633, "setIdentityM": 1647, "registerComponentCallbacks": 1305, "setTicker": 1957, "setLocality": 1713, "getMaximumRange": 630, "sort": 2041, "hasCookies": 973, "setMovementGranularities": 1743, "resolveOpacity": 1378, "getBondState": 337, "getTextSize": 831, "startDiscovery": 2053, "setLongClickable": 1716, "getFloat": 496, "getPosition": 693, "dismissDialog": 205, "setOnDismissListener": 1769, "setStartDelay": 1921, "setDisplayUseLogoEnabled": 1552, "setProgressBarVisibility": 1846, "loadIcon": 1103, "init": 998, "goForward": 966, "setTo": 1964, "removeGpsStatusListener": 1330, "getItemId": 566, "setTextIsSelectable": 1947, "setNotificationVisibility": 1755, "removeAllViews": 1324, "getSupportedFocusModes": 801, "getMemoryClass": 633, "fullScroll": 278, "hasSystemFeature": 986, "setRemovedCount": 1867, "gluLookAt": 960, "getSuggestAuthority": 794, "buildRootsUri": 78, "eglGetDisplay": 226, "writeEntityData": 2130, "closeContextMenu": 131, "setCurrentTab": 1522, "useHttpAuthUsernamePassword": 2120, "dismissDropDown": 206, "queue": 1290, "getThemedContext": 833, "getEndpointCount": 468, "isETC1Supported": 1034, "forgetLoadedWallpaper": 274, "assignContactUri": 62, "getStackTrace": 783, "setDisplayOrientation": 1548, "shouldOverrideUrlLoading": 2022, "checkServerTrusted": 102, "setStream": 1925, "setTextFilterEnabled": 1946, "getColor": 370, "onAnimationEnd": 1159, "getError": 470, "setOnClickPendingIntent": 1766, "setCharacteristicNotification": 1482, "getLoaderManager": 610, "deleteAllData": 182, "getNavigationMode": 650, "getConfiguredNetworks": 385, "getPrn": 709, "glDisableVertexAttribArray": 916, "addNextIntent": 29, "removeProximityAlert": 1338, "setDuration": 1569, "setEnabled": 1579, "getDevice": 437, "setLookAtM": 1718, "onCustomViewHidden": 1172, "setRequestedOrientation": 1874, "setDomStorageEnabled": 1560, "currentAnimationTimeMillis": 179, "getResourceName": 732, "setFeatureDrawableResource": 1593, "addNmeaListener": 30, "setLoadWithOverviewMode": 1710, "setOnCancelListener": 1761, "frustumM": 277, "write": 2128, "onResume": 1221, "addNetwork": 28, "assignContactFromPhone": 61, "connect": 146, "setImageLevel": 1651, "getDrawable": 458, "setImeActionLabel": 1658, "makeOutAnimation": 1116, "setTextZoom": 1952, "iterator": 1088, "popBackStackImmediate": 1274, "getSupportedPictureFormats": 803, "getAutoWhiteBalanceLock": 326, "setDefaultKeyMode": 1535, "buildChildDocumentsUri": 74, "requestPermission": 1366, "newTab": 1138, "setCornerRadius": 1513, "setColumnWidth": 1496, "removeViewAt": 1353, "getUrls": 858, "glTexSubImage2D": 951, "reenableKeyguard": 1303, "getChildView": 366, "setGradientRadius": 1626, "setTestProviderStatus": 1942, "getPresenceIconResourceId": 702, "addExtras": 17, "setLayoutParams": 1699, "clearCheck": 110, "createFromStream": 161, "setOnZoomListener": 1798, "removeDialog": 1326, "setPasswordMinimumNonLetter": 1817, "makeInAnimation": 1114, "updateCredentials": 2114, "onActionModeStarted": 1156, "setOnSearchClickListener": 1789, "getCheckedItemCount": 358, "setDatabasePath": 1531, "getAppWidgetIds": 312, "adjustMetaAfterKeypress": 49, "getCurrent": 403, "setMarqueeRepeatLimit": 1720, "removeHeaderView": 1332, "startFaceDetection": 2054, "mutate": 1130, "setScrollX": 1886, "getInteger": 548, "getDeviceSubclass": 442, "eglDestroySurface": 225, "unregisterDataSetObserver": 2105, "valueOf": 2122, "getSearchableInfo": 753, "recycle": 1302, "setIntrinsicWidth": 1678, "clearView": 127, "startPreview": 2062, "getFocusMode": 500, "remapCoordinateSystem": 1314, "getZoomRatios": 894, "getBackground": 331, "canZoomOut": 86, "getFilters": 491, "glClearColor": 905, "setCustomView": 1529, "getAltitude": 303, "getAccountsByType": 282, "createApplicationRecord": 155, "getSystemAvailableFeatures": 814, "loadAnimation": 1098, "setVisibleInDownloadsUi": 1993, "isPlaying": 1061, "getExposureCompensation": 477, "setCrossFadeEnabled": 1517, "wrap": 2127, "setGeolocationEnabled": 1619, "setPasswordMinimumLowerCase": 1816, "setPassword": 1813, "setCompoundDrawables": 1499, "incrementProgressBy": 994, "getPositionForSection": 694, "setInexactRepeating": 1665, "getAuthenticatorTypes": 324, "getOnItemSelectedListener": 661, "setOnPreparedListener": 1785, "markSupported": 1123, "checkSignatures": 103, "cancelDiscovery": 92, "makeText": 1118, "findAllAsync": 256, "setHorizontalScrollbarOverlay": 1640, "convert": 148, "eglMakeCurrent": 229, "resolveActivity": 1375, "setPitch": 1827, "getUName": 852, "createTexture": 173, "getRunningTasks": 745, "forceFinished": 273, "setNavigationMode": 1747, "setOnDrawerCloseListener": 1770, "getDeviceName": 440, "setTextOn": 1949, "getSelectedView": 762, "getTabContentView": 816, "getProgress": 714, "setFindListener": 1604, "postInvalidate": 1275, "setCurrentItemIndex": 1519, "getWindowManager": 887, "toString": 2099, "setContentDescription": 1504, "getCurrX": 401, "setImageURI": 1655, "removeAllListeners": 1321, "canGoForward": 83, "setMinValue": 1740, "setFocusMode": 1609, "obtainStyledAttributes": 1149, "setAnchorView": 1437, "getAssets": 321, "setGpsLongitude": 1622, "timePassed": 2094, "getProcessMemoryInfo": 710, "removeExpiredCookie": 1327, "setDeleteIntent": 1540, "setVerticalScrollbarOverlay": 1982, "getInstalledPackages": 541, "getPreferences": 699, "registerListener": 1310, "onCreateWindow": 1171, "setPositiveButton": 1829, "overlayVerticalScrollbar": 1253, "setCertificate": 1480, "accept": 6, "startNextMatchingActivity": 2059, "requestFocus": 1358, "setFillEnabled": 1597, "cancelAllNotifications": 89, "showNext": 2031, "usedInFix": 2121, "getAccountsByTypeAndFeatures": 283, "isIconified": 1047, "getErrorView": 471, "setNeutralButton": 1753, "getLargeMemoryClass": 575, "glGenFramebuffers": 925, "eglCreateContext": 221, "setOrientation": 1804, "registerForContextMenu": 1308, "setPreviewFpsRange": 1837, "openContactPhotoInputStream": 1245, "getSelectedTab": 761, "hasError": 976, "setWidth": 2004, "setRecordingHint": 1862, "setInitialSavedState": 1666, "getSections": 756, "setGradientType": 1627, "isCancelable": 1020, "setRawInputType": 1860, "setZoomChangeListener": 2013, "getXOffset": 889, "clearServiceRequests": 123, "glUniform1f": 952, "findViewById": 263, "setButton": 1469, "setProvider": 1855, "getAnimatedValue": 306, "getInterfaceCount": 553, "setVideoURI": 1987, "setProgressPercentFormat": 1849, "setAnimationStyle": 1440, "getRetainInstance": 738, "setPrompt": 1851, "getName": 647, "getHeadersCount": 518, "addAnimation": 13, "getEncoding": 466, "getSupportedPreviewFrameRates": 807, "setSummaryText": 1932, "setAppCacheEnabled": 1444, "getFragmentManager": 506, "getDisplays": 454, "setMediaController": 1731, "getCursor": 414, "getSourcePackage": 777, "setChecked": 1485, "setForeground": 1613, "initialize": 1000, "getHeaderViewsCount": 517, "setPrivateImeOptions": 1841, "print": 1277, "saveConfiguration": 1394, "replace": 1354, "getSupportedJpegThumbnailSizes": 802, "getProviders": 719, "getOutputStream": 667, "getResourcesForApplication": 736, "getSupplicantState": 797, "getListView": 608, "setupStartValues": 2019, "getSelectionStart": 764, "clearCache": 109, "getSectionForPosition": 755, "setServiceInfo": 1899, "setContentTitle": 1508, "closeProfileProxy": 132, "setCancelable": 1478, "animateClose": 54, "pointToPosition": 1272, "onLayoutCancelled": 1194, "stopManagingCursor": 2073, "setAddressLine": 1424, "makeAudioCall": 1112, "getDefaultPaddingForWidget": 427, "setIncludeFontPadding": 1661, "getParameters": 680, "glTexParameteri": 949, "onWriteFinished": 1243, "eglChooseConfig": 220, "getContentView": 394, "sourceId": 2042, "cancelNotification": 94, "setSaveFormData": 1880, "beginTransaction": 67, "setWebContentsDebuggingEnabled": 1998, "setZAdjustment": 2011, "setColorFilter": 1493, "getVoiceSearchLaunchWebSearch": 881, "getAlignment": 298, "update": 2111, "checkError": 100, "isOneShot": 1058, "removeBearing": 1325, "setMediaSize": 1733, "startScroll": 2064, "isDocumentUri": 1032, "makeInChildBottomAnimation": 1115, "getBondedDevices": 338, "setAllowedOverRoaming": 1433, "onConfigurationChanged": 1166, "setVisible": 1992, "getAllowFileAccess": 300, "initLoader": 999, "setKeyListener": 1690, "getView": 877, "setFastScrollEnabled": 1592, "onTrimMemory": 1237, "getSpanStart": 780, "setEllipsize": 1575, "query": 1284, "onItemSelected": 1187, "getUserId": 861, "getHttpAuthUsernamePassword": 524, "clearFormData": 114, "loadUrl": 1108, "getFlatListPosition": 495, "getAddressLine": 295, "setCurrentPlayTime": 1521, "isVisible": 1085, "setDisplayShowHomeEnabled": 1550, "getChildAnimations": 363, "stopVoiceRecognition": 2081, "setOnGroupClickListener": 1775, "getEndpoint": 467, "glGenerateMipmap": 927, "hasLatitude": 978, "reload": 1313, "notifyDataSetChanged": 1145, "getAntibanding": 311, "newSpannable": 1137, "check": 99, "setPictureSize": 1826, "getSSID": 746, "sendExtraCommand": 1412, "getProperties": 716, "getSubAdminArea": 791, "setJavaScriptCanOpenWindowsAutomatically": 1685, "setSpeedRequired": 1918, "getItemViewType": 568, "getSelectedNavigationIndex": 760, "setInterpolator": 1676, "glEnableVertexAttribArray": 920, "selectTab": 1409, "getSize": 773, "getFilterQueryProvider": 490, "enableNetwork": 238, "goBackOrForward": 965, "onActionViewCollapsed": 1157, "addOnMenuVisibilityListener": 33, "setProgressBar": 1843, "getHandle": 516, "stopPreview": 2075, "peekValue": 1263, "getAuthTokenByFeatures": 323, "toCharsString": 2097, "onStopTrackingTouch": 1230, "showDialog": 2028, "getStartTime": 785, "setFlashMode": 1606, "toBundle": 2095, "isAutoWhiteBalanceLockSupported": 1019, "getPostalCode": 696, "getPackagesForUid": 672, "setNdefPushMessage": 1748, "getActionBar": 285, "getRemoteDevice": 726, "getWallpaperInfo": 882, "setAllowContentAccess": 1428, "getXml": 890, "setBounds": 1467, "getPermissionInfo": 688, "addTestProvider": 41, "getTargetContext": 821, "getPreviewSize": 706, "hasGrantedPolicy": 977, "setAllowFileAccess": 1429, "dispatchCreate": 207, "registerActivityLifecycleCallbacks": 1304, "getIntArray": 547, "getViewTypeCount": 878, "setDither": 1556, "setDividerHeight": 1558, "startScan": 2063, "setFullscreen": 1617, "setVibrate": 1984, "onReceivedIcon": 1211, "setPaintFlags": 1811, "glFramebufferTexture2D": 923, "getFeatureName": 485, "isVideoSnapshotSupported": 1083, "inflateTransition": 997, "setParameters": 1812, "getDeviceConfigurationInfo": 439, "setDefaultZoom": 1537, "evaluateJavascript": 246, "setHomeButtonEnabled": 1638, "enqueue": 244, "getDefaultActivityIcon": 423, "setPreviewSize": 1839, "getAnimatedFraction": 305, "sendStringSync": 1416, "isValidUrl": 1082, "smoothScrollBy": 2037, "onCheckedChanged": 1163, "setAppCacheMaxSize": 1445, "onUnhandledKeyEvent": 1238, "setDescription": 1541, "stopSearch": 2076, "moveTaskToFront": 1127, "findTokenEnd": 261, "getSystem": 813, "writeToParcel": 2134, "setLines": 1704, "setPhone": 1823, "getDialog": 444, "setMaxHeight": 1723, "createFromXml": 162, "clearComposingText": 113, "setEGLWindowSurfaceFactory": 1573, "setRetainInstance": 1877, "addLine": 25, "getDimension": 445, "removeAllCookie": 1319, "getTnf": 841, "getLayoutInflater": 586, "setEGLContextFactory": 1572, "showFindDialog": 2030, "setOnItemLongClickListener": 1780, "ofPropertyValuesHolder": 1155, "setPowerRequirement": 1831, "setImageBitmap": 1649, "setViewBinder": 1989, "eglGetError": 227, "getFinalY": 492, "glGenBuffers": 924, "putString": 1283, "unlock": 2103, "onTouchEvent": 1236, "clear": 106, "getLevel": 588, "getResourceEntryName": 730, "createFromPath": 158, "setGravity": 1628, "loadLabel": 1105, "getIconResource": 526, "requestGroupInfo": 1360, "setInt": 1671, "setOnClickFillInIntent": 1764, "startActivityIfNeeded": 2051, "addGpsStatusListener": 20, "setSubtitle": 1930, "createRfcommSocketToServiceRecord": 171, "shouldRewriteQueryFromText": 2024, "glDeleteProgram": 911, "setSecondaryProgress": 1891, "onReceivedSslError": 1213, "setMaxValue": 1727, "dispatchStop": 213, "setTokenizer": 1967, "onRelease": 1216, "setMeasureAllChildren": 1730, "discoverPeers": 201, "setSoftInputMode": 1910, "glUniform4fv": 954, "setTileModeX": 1958, "setOnItemSelectedListener": 1781, "getIntentSender": 550, "setZoomSpeed": 2016, "glScissor": 944, "copyBounds": 150, "getTargetRequestCode": 824, "enoughToFilter": 243, "setPreviewCallbackWithBuffer": 1834, "setBlockNetworkImage": 1466, "createSpeechRecognizer": 172, "createPrintDocumentAdapter": 170, "getProtocolLabel": 717, "overridePendingTransition": 1254, "setPictureListener": 1825, "setProgressBarIndeterminateVisibility": 1845, "fromHtml": 276, "setSmoothScrollbarEnabled": 1908, "getApplicationEnabledSetting": 316, "isHidden": 1044, "setReferenceCounted": 1864, "queryContentProviders": 1286, "addUpdateListener": 46, "getIntrinsicHeight": 558, "getTotalPaddingTop": 843, "glClear": 904, "onItemClick": 1185, "showAsDropDown": 2026, "onScrollChanged": 1226, "setClippingEnabled": 1490, "texImage2D": 2092, "startActionMode": 2046, "getPhone": 689, "after": 50, "setTextColor": 1945, "getLinkSpeed": 603, "setLightTouchEnabled": 1701, "setThoroughfare": 1953, "getLineTop": 601, "restartLoader": 1381, "getLineForOffset": 595, "setInverseBackgroundForced": 1679, "makeScaleUpAnimation": 1117, "glCompileShader": 906, "createFromResource": 159, "canGoBack": 81, "setDebugFlags": 1532, "onSaveInstanceState": 1223, "getTime": 839, "smoothScrollTo": 2038, "startActivitySync": 2052, "saveFragmentInstanceState": 1395, "getTrimmedLength": 846, "getCName": 345, "queryBroadcastReceivers": 1285, "setEms": 1578, "getInterpolation": 556, "setAntiAlias": 1442, "setHasOptionsMenu": 1630, "setHorizontalSpacing": 1641, "isTouchExplorationEnabled": 1079, "getValidNotBefore": 868, "onTextChanged": 1234, "getBroadcast": 341, "startActivities": 2047, "setOrder": 1803, "setInputMethodMode": 1669, "sendWallpaperCommand": 1417, "getChild": 362, "getDimensionPixelOffset": 446, "glMatrixMode": 940, "setRotateM": 1878, "onLayoutFinished": 1195, "setDisplayZoomControls": 1553, "setMinLines": 1739, "setQueryHint": 1857, "getConfiguration": 384, "removeRule": 1339, "getPreferredActivities": 700, "getStretchMode": 787, "computeVerticalScrollOffset": 142, "removeOnAccountsUpdatedListener": 1337, "glGetError": 929, "getDataSize": 417, "destroy": 188, "getCurrentTabTag": 411, "isLowRamDevice": 1055, "resetTransition": 1374, "setEGLConfigChooser": 1570, "setupEndValues": 2018, "getSupportedVideoSizes": 810, "startManagingCursor": 2058, "freeMemory": 275, "setCheckable": 1484, "setItems": 1683, "instantiate": 1004, "isChild": 1024, "getMaximumTimeToLock": 631, "setFaceDetectionListener": 1589, "setFinishOnTouchOutside": 1605, "glViewport": 958, "onReceivedTitle": 1214, "setDnsSdResponseListeners": 1559, "buildRecentDocumentsUri": 76, "changeCursor": 97, "onInitializeAccessibilityNodeInfo": 1183, "loadThumbnail": 1107, "setHeight": 1632, "setMax": 1721, "setFilters": 1602, "setButton3": 1471, "createPersonInMyContactsGroup": 169, "setOnCloseListener": 1767, "addListener": 26, "getResourceId": 731, "getDhcpInfo": 443, "getService": 767, "getFromLocationName": 509, "getExtras": 481, "setY": 2010, "setDestinationInExternalPublicDir": 1543, "getEngines": 469, "setMapTrackballToArrowKeys": 1719, "setStyle": 1929, "getLayout": 583, "pageScroll": 1256, "getExposureCompensationStep": 478, "setDrawableByLayerId": 1563, "getItem": 563, "removeJavascriptInterface": 1333, "invalidateViews": 1009, "updateDrawState": 2116, "setSize": 1906, "setOnScrollListener": 1788, "setBackgroundColor": 1456, "setHorizontalAccuracy": 1639, "getVoiceSearchLaunchRecognizer": 880, "getDefaultSensor": 428, "play": 1268, "getJpegQuality": 570, "getDeviceClass": 438, "clearSearches": 122, "isClearable": 1025, "getAddedCount": 293, "invalidateOptionsMenu": 1007, "getLatitude": 579, "onClick": 1164, "isInLayout": 1048, "bigPicture": 69, "setStretchMode": 1926, "isDone": 1033, "registerDataSetObserver": 1306, "glTexImage2D": 947, "attach": 63, "removeListener": 1334, "isChangingConfigurations": 1022, "getLineForVertical": 596, "RGBA_8888": 3, "before": 66, "setQuery": 1856, "getThreshold": 835, "setLatestEventInfo": 1694, "isStateful": 1077, "setUseLevel": 1976, "chooseConfig": 104, "getItemAtIndex": 564, "getAppWidgetInfo": 313, "getConstantState": 388, "getAnimationForView": 308, "openFd": 1247, "glGetProgramiv": 932, "setOnDrawerOpenListener": 1771, "setTextOff": 1948, "getRssi": 741, "setCustomAnimations": 1526, "setBaselineAligned": 1459, "setSingleLine": 1905, "onDrawFrame": 1176, "setPluginState": 1828, "removeGpsData": 1329, "setOnChildClickListener": 1763, "setCurrentHour": 1518, "setCameraDisabled": 1477, "getProfileProxy": 713, "getTileModeY": 838, "setStartOffset": 1922, "getAuthToken": 322, "isAboutUrl": 1013, "getOwnerActivity": 668, "getJavaScriptEnabled": 569, "addCallbackBuffer": 14, "setOnCheckedChangeListener": 1762, "speak": 2043, "setAccuracy": 1421, "isRunningInTestHarness": 1071, "isRemoving": 1068, "getChildrenCount": 367, "setButtonDrawable": 1472, "getDuration": 461, "setElapsedRealtimeNanos": 1574, "getComponentEnabledSetting": 376, "getButton": 344, "printStackTrace": 1278, "sendKeyDownUpSync": 1413, "setItemChecked": 1681, "lastIndexOf": 1093, "skipEntityData": 2036, "getSpanEnd": 778, "stopSelfResult": 2078, "getUserAgentString": 859, "getAddress": 294, "setObjectValues": 1759, "createFromXmlInner": 163, "setError": 1581, "getQuantityString": 720, "copyFrom": 151, "getDefaultEngine": 426, "setTextAppearance": 1944, "writeNdefMessage": 2132, "setSelectionAfterHeaderView": 1896, "goBack": 964, "getObjectHandle": 658, "setSortKey": 1911, "isAutoExposureLockSupported": 1018, "glDeleteTextures": 914, "setSource": 1913, "getOName": 657, "getFilter": 489, "getDetailedStateOf": 436, "setAdjustViewBounds": 1425, "getAutoExposureLock": 325, "supportsBearing": 2088, "setHint": 1634, "setId": 1646, "getInterface": 551, "setCursorVisible": 1525, "setArguments": 1447, "getUserData": 860, "hasText": 987, "getPaint": 678, "getResourcePackageName": 733, "setLargeIcon": 1693, "newLine": 1136, "cancelConnect": 91, "forEach": 272, "onStartTrackingTouch": 1228, "setDropDownWidth": 1568, "setStackedBackgroundDrawable": 1920, "getAnimations": 310, "onDateSet": 1173, "getEventTime": 472, "getGroupCount": 514, "removeAccount": 1316, "diff": 193, "isPresent": 1063, "getSettings": 770, "getApplicationIcon": 317, "translateM": 2101, "getRecentTasks": 724, "removeTarget": 1346, "createFromResourceStream": 160, "setMaxLines": 1724, "addAccount": 10, "getHitTestResult": 522, "fling": 269, "setCallback": 1475, "writePendingIntentOrNullToParcel": 2133, "getTransformation": 844, "getInt": 546, "onNothingSelected": 1199, "setDropDownHeight": 1565, "setVideoPath": 1985, "startActivityForResult": 2049, "setPasswordMinimumLength": 1814, "getTransparentRegion": 845, "hasSpeed": 983, "cancelAll": 88, "getCharacteristic": 356, "getSubtitle": 793, "setLatitude": 1695, "getPasswordQuality": 685, "setZoomInEnabled": 2014, "isHeld": 1043, "saveInstanceState": 1396, "getInternalFormat": 555, "setComponentEnabledSetting": 1497, "glDrawElements": 918, "recreate": 1301, "setMaximumTimeToLock": 1729, "removeTextChangedListener": 1348, "clearHistory": 115, "hasEnded": 974, "setToDefaults": 1965, "glBlendFunc": 901, "setCompoundDrawablesRelativeWithIntrinsicBounds": 1501, "setTestProviderEnabled": 1940, "setToIndex": 1966, "getIndeterminateDrawable": 532, "resolveContentProvider": 1377, "isContentUrl": 1026, "setTranscriptMode": 1971, "getPower": 697, "setHintTextColor": 1635, "getBuiltInZoomControls": 343, "setTextSize": 1950, "setTime": 1960, "setThreshold": 1954, "setViewVisibility": 1990, "enableCarMode": 235, "setProgressNumberFormat": 1848, "getSelectedItemId": 758, "getIntrinsicWidth": 559, "setDestinationUri": 1544, "getIntent": 549, "withAlpha": 2126, "getActivityLogo": 291, "getContentUri": 392, "setCustomTitle": 1528, "isAdminActive": 1016, "clearChoices": 111, "start": 2045, "setLocationProviderEnabled": 1714, "setPackageName": 1809, "getChildFragmentManager": 364, "glCreateShader": 909, "setRenderMode": 1868, "getNameForUid": 648, "getMonth": 645, "bearingTo": 65, "mark": 1121, "setVerticalSpacing": 1983, "isDestroyed": 1028, "concat": 144, "glGenTextures": 926, "stopListening": 2071, "getCookie": 396, "encodePredefinedImProtocol": 241, "getCurrentTab": 410, "addToBackStack": 43, "getRecords": 725, "ArrayAdapter<String>": 2, "loadDataWithBaseURL": 1102, "join": 1089, "getLayoutDimension": 584, "getMovementMethod": 646, "setHeaderDividersEnabled": 1631, "htmlEncode": 992, "setTestProviderLocation": 1941, "getCountryName": 399, "getPaintFlags": 679, "getPadding": 677, "deleteFromHistory": 185, "addFrame": 19, "setOneShotPreviewCallback": 1800, "with": 2125, "substring": 2085, "getTaskId": 826, "getMessage": 637, "getIpAddress": 560, "getProvider": 718, "setContentIntent": 1506, "getLocality": 615, "setDefaultFontSize": 1534, "getImageMatrix": 529, "getThumbnail": 836, "notifyAppWidgetViewDataChanged": 1144, "setShowRunningNotification": 1903, "getLastKnownLocation": 576, "getDateCreated": 418, "setMultiChoiceItems": 1745, "getContentHeight": 391, "getContentDescription": 390, "setSmallIcon": 1907, "setPropertyName": 1854, "setOutAnimation": 1805, "equals": 245, "getTextScaleX": 830, "getYOffset": 891, "getSearchActivity": 752, "glDeleteRenderbuffers": 912, "scheduleDrawable": 1402, "clearPassword": 121, "setAdminArea": 1426, "getActivity": 288, "getActiveAdmins": 286, "setTargetDensity": 1938, "isZoomSupported": 1087, "getMatrix": 621, "setOnRatingBarChangeListener": 1787, "setErrorCallback": 1582, "getClassName": 369, "getDayOfMonth": 420, "getSearchablesInGlobalSearch": 754, "finish": 264, "getNumberOfLayers": 656, "glBindBuffer": 898, "getStyle": 790, "getApplicationInfo": 318, "setClickable": 1489, "setFooterDividersEnabled": 1612, "toByteArray": 2096, "onPull": 1207, "bigText": 70, "computeDurationHint": 137, "documentHasImages": 218, "release": 1311, "onInitializeAccessibilityEvent": 1182, "getTextArray": 828, "setPreviewFormat": 1836, "readCharacteristic": 1293, "setDisplayedValues": 1555, "isTaskRoot": 1078, "getCallingActivity": 348, "getMemoryInfo": 634, "getProfileConnectionState": 712, "obtain": 1147, "setTouchInterceptor": 1969, "getForegroundColor": 503, "findAll": 255, "setDestinationInExternalFilesDir": 1542, "setFormatter": 1614, "onAnimationStart": 1160, "resume": 1385, "setState": 1924, "glReadPixels": 943, "isEnabled": 1036, "getValidNotAfterDate": 867, "lock": 1109, "setThumb": 1955, "list": 1096, "createMulticastLock": 168, "setTouchable": 1970, "newTheme": 1140, "setRotation": 1879, "findTokenStart": 262, "getDivider": 455, "newDrawable": 1132, "acquire": 7, "getDisplayName": 451, "onLoadResource": 1196, "setShadowLayer": 1901, "setSelectAllOnFocus": 1892, "getPreferredPreviewSizeForVideo": 701, "setCostAllowed": 1514, "getSuggestSelection": 796, "setJavaScriptEnabled": 1686, "setEmptyText": 1576, "shutdown": 2034, "getUriFor": 854, "getChoiceMode": 368, "clearLocalServices": 117, "getDesiredMinimumWidth": 434, "setTransformationMethod": 1972, "select": 1406, "removeSelection": 1340, "sendPointerSync": 1415, "buildRootUri": 77, "detach": 192, "getScanMode": 749, "getColorMode": 373, "dispatchResume": 212, "glTexParameterx": 950, "addServiceRequest": 38, "openRawResourceFd": 1250, "getServiceInfo": 768, "getSceneMode": 751, "setCountryCode": 1515, "addTextChangedListener": 42, "inflate": 996, "managedQuery": 1120, "commit": 134, "glDeleteShader": 913, "hasWindowFocus": 989, "getWindow": 886, "glEnable": 919, "setAntibanding": 1443, "message": 1124, "addJavascriptInterface": 23, "setRecyclerListener": 1863, "set": 1418, "getTargets": 825, "setOnUtteranceCompletedListener": 1795, "getLocalizedMessage": 616, "length": 1094, "getMessagesFromIntent": 638, "saveWebArchive": 1400, "startSmoothZoom": 2066, "getChangingConfigurations": 355, "setDisplayShowTitleEnabled": 1551, "getCountryCode": 398, "glTexParameterf": 948, "getSpeed": 782, "makeThumbnailScaleUpAnimation": 1119, "getThoroughfare": 834, "setBigContentTitle": 1464, "selectAll": 1407, "onJsBeforeUnload": 1189, "disableTransitionType": 199, "ofKeyframe": 1153, "setEGLContextClientVersion": 1571, "setEventType": 1585, "deleteDocument": 184, "setOnGroupCollapseListener": 1776, "setRemoteAdapter": 1866, "getAlpha": 302, "isOpened": 1060, "multiplyMM": 1128, "getTypeLabelResource": 849, "getPictureSize": 692, "setJpegThumbnailQuality": 1688, 